In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
df = pd.read_csv('../datasets/df_data_cleaned.csv')
df.head()

                   location  total_sqft  bath   price  BHK
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0   95.00    3
4                  Kothanur      1200.0   2.0   51.00    2

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13201 entries, 0 to 13200
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13201 non-null  object
 1   total_sqft  13201 non-null  float64
 2   bath        13201 non-null  float64
 3   price       13201 non-null  float64
 4   BHK         13201 non-null  int64
dtypes: float64(3), int64(1), object(1)
memory usage: 515.8+ KB

In [5]:
df['location'].nunique()

1298

In [55]:
location_data = df['location'].value_counts()

In [62]:
location_threshold_for_other = location_data.mean()

**Areas with value count of greater than mean of the value counts are considered as main areas of bangalore.**

**Areas with value count of lesser or equal to the mean of the value counts are considered as other.**

In [65]:
location_data[location_data > location_threshold_for_other] ## Key Areas Of Bangalore

location
Whitefield          533
Sarjapur  Road      392
Electronic City     302
Kanakpura Road      264
Thanisandra         232
                   ...
HAL 2nd Stage        11
LB Shastri Nagar     11
Tindlu               11
Marsur               11
Bommenahalli         11
Name: count, Length: 240, dtype: int64

In [68]:
other_locations = location_data[location_data <= location_threshold_for_other] #other

In [72]:
df['location'] = df['location'].apply(lambda x:'other' if x in other_locations else x)

In [73]:
df['location'].value_counts()

location
other                        2887
Whitefield                    533
Sarjapur  Road                392
Electronic City               302
Kanakpura Road                264
                             ...
Pattandur Agrahara             11
2nd Phase Judicial Layout      11
Bommenahalli                   11
Marsur                         11
LB Shastri Nagar               11
Name: count, Length: 241, dtype: int64

In [74]:
df.head()

                   location  total_sqft  bath   price  BHK
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0   95.00    3
4                  Kothanur      1200.0   2.0   51.00    2

**Now we will find out price per sqft.**

**The Price is given in lacs.**

In [80]:
df['price_per_sqft'] = ((df['price'] * 100000) / df['total_sqft'])

In [81]:
df.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                  Kothanur      1200.0   2.0   51.00    2     4250.000000

In [83]:
df.to_csv('../datasets/df_before_one_hot_encoding.csv',index=False)